app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 2]]
---
  def index
    @contacts = current_user.contacts.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "text_field_values".* FROM "text_field_values" WHERE "text_field_values"."contact_id" = ?  [["contact_id", 13]]
SELECT "text_area_values".* FROM "text_area_values" WHERE "text_area_values"."contact_id" = ?  [["contact_id", 18]]
SELECT "dropdown_values".* FROM "dropdown_values" WHERE "dropdown_values"."contact_id" = ?  [["contact_id", 28]]
---
  def show
    @contact = Contact.find(params[:id])
    @text_field_values  = @contact.text_field_values.all
    @text_area_values   = @contact.text_area_values.all
    @dropdown_values    = @contact.dropdown_values.all

INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dona Pousen"], ["email", "dona@email.com"], ["user_id", 1], ["created_at", 2016-07-21 17:19:57 UTC], ["updated_at", 2016-07-21 17:19:57 UTC]]
INSERT INTO "text_field_values" ("name", "value", "text_field_id", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mobile"], ["value", "19823983"], ["text_field_id", 1], ["contact_id", 3], ["created_at", 2016-07-22 01:39:54 UTC], ["updated_at", 2016-07-22 01:39:54 UTC]]
INSERT INTO "text_area_values" ("name", "value", "contact_id", "created_at", "updated_at", "text_area_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "dropdown_values" ("content", "value", "dropdown_id", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Qual seu ultimo salário?"], ["value", "1000 - 2000 \r\n"], ["dropdown_id", 3], ["contact_id", 31], ["created_at", 2016-07-20 13:30:41 UTC], ["updated_at", 2016-07-20 13:30:41 UTC]]
---
  def create

    @contact = Contact.new(contact_params(params[:contact]))
    @contact.user_id = current_user.id

      Contact.transaction do
        respond_to do |format|
          if @contact.save

            params[:text_field_values].each do |param|
              @text_field_value = TextFieldValue.new(text_field_values_parms(param))
              @text_field_value.contact_id = @contact.id
              @text_field_value.save
            end

            params[:text_area_values].each do |param|
              @text_area_value = TextAreaValue.new(text_area_values_params(param))
              @text_area_value.contact_id = @contact.id
              @text_area_value.save
            end

            params[:dropdown_values].each do |param|
              @dropdown_value = DropdownValue.new(dropdowns_params(param))
              @dropdown_value.contact_id = @contact.id
              @dropdown_value.save