app/controllers/dropdowns_controller.rb

  def index
    @dropdowns = current_user.dropdowns.all
---
SELECT "dropdowns".* FROM "dropdowns" WHERE "dropdowns"."user_id" = ?  [["user_id", 2]]

  def create
    @user = current_user
    @dropdown = Dropdown.new(dropdown_params)
    @dropdown.user_id = @user.id
    @dropdown.options = validate_dropdown_options(dropdown_params[:options])

    respond_to do |format|
      if @dropdown.save
---
INSERT INTO "dropdowns" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Qual a sua área de formação?"], ["user_id", 1], ["created_at", 2016-07-20 01:45:50 UTC], ["updated_at", 2016-07-20 01:45:50 UTC]]

  def update
    respond_to do |format|

      if @dropdown.update(dropdown_params)
---
UPDATE "dropdowns" SET "options" = ?, "updated_at" = ? WHERE "dropdowns"."id" = ?  [["options", "*1000 - 2000 \r\n* 2000 - 3000 \r\n* 3000 - 5000 \r\n*5000 - 8000\r\n* > 8000"], ["updated_at", 2016-07-20 12:35:28 UTC], ["id", 3]]

    def set_dropdown
      @dropdown = Dropdown.find(params[:id])
---
SELECT  "dropdowns".* FROM "dropdowns" WHERE "dropdowns"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]