app/controllers/static_pages_controller.rb

  def home
  	@contact = Contact.new
  	@user = current_user

  	@text_fields = []

  	@user.text_fields.all.each do |tf|
  		@text_fields << {'text_field': tf ,'value': TextFieldValue.new}
  	end

    @text_areas = []
    @user.text_areas.all.each do |ta|
      @text_areas << {'text_area': ta, 'value': TextAreaValue.new}
    end

    @dropdowns = []
    @user.dropdowns.all.each do |dd|
---
SELECT "text_fields".* FROM "text_fields" WHERE "text_fields"."user_id" = ?  [["user_id", 1]]
SELECT "text_areas".* FROM "text_areas" WHERE "text_areas"."user_id" = ?  [["user_id", 1]]
SELECT "dropdowns".* FROM "dropdowns" WHERE "dropdowns"."user_id" = ?  [["user_id", 1]]

  def contact_fields
  	@user = current_user
  	@text_fields = @user.text_fields.all
    @text_areas = @user.text_areas.all
    @dropdowns = @user.dropdowns.all
---
SELECT "text_fields".* FROM "text_fields" WHERE "text_fields"."user_id" = ? ORDER BY "text_fields"."created_at" ASC  [["user_id", 1]]
SELECT "text_areas".* FROM "text_areas" WHERE "text_areas"."user_id" = ?  [["user_id", 1]]
SELECT "dropdowns".* FROM "dropdowns" WHERE "dropdowns"."user_id" = ?  [["user_id", 1]]