app/controllers/text_areas_controller.rb

SELECT "text_areas".* FROM "text_areas"
---
  def index
    @text_areas = TextArea.all

INSERT INTO "text_areas" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tell me a bit about you"], ["user_id", 1], ["created_at", 2016-07-21 17:21:08 UTC], ["updated_at", 2016-07-21 17:21:08 UTC]]
---
  def create
    @text_area = TextArea.new(text_area_params)
    @text_area.user_id = current_user.id

    respond_to do |format|
      if @text_area.save

UPDATE "text_areas" SET "name" = ?, "updated_at" = ? WHERE "text_areas"."id" = ?  [["name", "Tell me a bit about you. What are your strongs? And your weakness?"], ["updated_at", 2016-07-19 22:13:21 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @text_area.update(text_area_params)

SELECT  "text_areas".* FROM "text_areas" WHERE "text_areas"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_text_area
      @text_area = TextArea.find(params[:id])