app/controllers/text_fields_controller.rb

  def index
    @text_fields = TextField.all
---
SELECT "text_fields".* FROM "text_fields"

  def create
    @text_field = TextField.new(text_field_params)
    @text_field.user_id = current_user.id
    respond_to do |format|
      if @text_field.save
---
INSERT INTO "text_fields" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mobile"], ["user_id", 1], ["created_at", 2016-07-21 17:20:38 UTC], ["updated_at", 2016-07-21 17:20:38 UTC]]

  def destroy
    @text_field.destroy
---
DELETE FROM "text_fields" WHERE "text_fields"."id" = ?  [["id", 1]]

    def set_text_field
      @text_field = TextField.find(params[:id])
---
SELECT  "text_fields".* FROM "text_fields" WHERE "text_fields"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]