app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password", "password_confirmation") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Harvey"], ["email", "harvey@email.com"], ["created_at", 2016-07-21 17:19:42 UTC], ["updated_at", 2016-07-21 17:19:42 UTC], ["password", "senha1"], ["password_confirmation", "senha1"]]
---
  def create

  	#debugger
  	@user = User.new(users_params)

  	if @user.save